[{
    "_id": "59f9ae14706c4779a96a091b",
    "updatedAt": "2017-11-01T11:28:23.662Z",
    "createdAt": "2017-11-01T11:20:52.125Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 16
        },
        "pinterest": {
          "shares": 6
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 147,
          "comments": 0,
          "likes": 147
        }
      },
      "mainImage": "https://media.coindesk.com/uploads/2017/10/Untitled-design-67.jpg",
      "domainRank": 10453,
      "text": "Survey: Younger Americans More Interested in Cryptocurrencies, ICOs Oct 31, 2017 at 18:00 News • Investments • Initial Coin Offerings \nYounger Americans appear to be more interested in cryptocurrencies compared to other age groups. \nThat's according to the latest survey published by digital student loan servicer LendEDU, which asked roughly 1,000 U.S. citizens about ether and Ripple's XRP token at the end of October. The questions ranged from whether people had heard of ether and XRP to if they would invest in the cryptocurrencies. \nAccording to the survey, 31.6 percent of respondents have heard of ethereum (with 18.2 percent planning to invest in it) while 22.2 percent have heard of XRP (with 14.8 percent intending to purchase some). \nAfter breaking the results down by age, the data shows that roughly a third of respondents between the ages of 18 and 44 planned to invest in ether, while another third did not. The final third was uncertain. \nA far smaller portion of adults aged 45 and up planned to invest in ethereum, with between 89–98 percent of respondents saying they were either not going to invest or were unsure. \nThe results of the research closely match LendEDU's previous survey , which instead took a focus on bitcoin. In that survey, the majority of respondents who had heard of bitcoin were also in the younger age ranges, while older respondents indicated less awareness of the cryptocurrency. \nThe latest survey also looked at initial coin offerings (ICOs), finding that roughly a quarter of respondents had heard of the blockchain funding model, while 75.1 percent had not. However, there was some uncertainty around the status of ICOs among even those who had heard of them. \nLendEDU said of the results: \n\"In our September survey, we found that 10.69 percent of Americans believed that owning bitcoin was illegal in the United States. In our October survey, we found that 21.00 percent of respondents believe that investing in an initial coin offering is illegal. And, 61.10 percent of respondents were unsure about the legality of investing in an initial coin offering.\" \nOn the other hand, 15.1 percent of respondents said they plan to invest in an ICO in the future. \nDisclosure: CoinDesk is a subsidiary of Digital Currency Group, which has an ownership stake in Ripple. \nSurvey image via Shutterstock The leader in blockchain news, CoinDesk is an independent media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies . Have breaking news or a story tip to send to our journalists? Contact us at . ...",
      "crawled": "2017-10-31T20:10:58.002+02:00",
      "title": "Survey: Younger Americans More Interested in Cryptocurrencies, ICOs",
      "published": "2017-10-31T20:00:00.000+02:00",
      "author": "Nikhilesh De",
      "url": "http://omgili.com/ri/.wHSUbtEfZSn_gk062VlfY4LrqtSUM5Bo2mf1FyMc9oZtgcqtaiCaAngVCAlu8wk0kSCR6QXN0Tp7c7FOa7zNjhfhuAb3Q9jGR2LQ_mJnLdDc.fEkVcvVw--",
      "site": "coindesk.com",
      "uuid": "92eb20008b9405be218e7747e8b76c2c93ed8b28"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0,
    "documentSentiment" : {
      "score": -0.1,
      "magnitude": 0.100 
    }
  },
  {
    "_id": "59f9ae14706c4779a96a091e",
    "updatedAt": "2017-11-01T11:28:23.732Z",
    "createdAt": "2017-11-01T11:20:52.156Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 18
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 115,
          "comments": 0,
          "likes": 115
        }
      },
      "mainImage": "https://media.coindesk.com/uploads/2017/10/Screen-Shot-2017-10-30-at-10.03.35-PM-e1509415528585.png",
      "domainRank": 10453,
      "text": "Last Laugh? Dilbert Creator Scott Adams Talks Plans for Token Launch Oct 31, 2017 at 13:30 Features • Investments • Initial Coin Offerings \nWhen Scott Adams announced his company would embark on an initial coin offering (ICO) on his blog Friday, he wrote without sarcasm that the day might be one of the \"biggest\" of his life. \nQuite the statement from the creator of the beloved Dilbert comic strip, readers may be surprised given Adams' recent, pointed take on blockchain mania . But far from just lampooning the technology, Adams is gearing up to get firsthand experience of how it can be used for fundraising. \nWhenHub – a time visualization firm co-founded by Adams – is now preparing to launch a token of its own, preceded by an offering of Simple Agreements for Future Tokens, or SAFTs . \nThe project, according to Adams, allows subject matter experts to sell small amounts of time to clients, who will consult in a Skype-like video call session over the platform, the WhenHub Interface Network (WIN). The new product will facilitate auctions and payments, a system that would be built on top of ethereum using smart contracts , taking the tedium out of payments and invoicing. \nIn interview, Adams explained that he went through much the same process as everyone else: going from asking \"What the hell is this?\" to having days where he kind of started to get it and others where he could see the bigger picture. \nAdams told CoinDesk: \n\"Once you see different applications for the blockchain, you start to see: This is way more than I ever imagined.\" \nAdams went on to explain his recent strips about blockchain aren't intended to inspire others to write off blockchain tech. \nRather, he said, they have been inspired by how difficult it can be to explain the technology. In this way, he reasons the comics reflect the way it feels when someone understands something very new and they have to talk to someone else who doesn't. \n\"This is based on a real technology that I think you can say is tried and true,\" Adams said. \"It's not like a management fad ... It's more like the internet in the early days.\" \nBitcoin, in particular, has impressed Adams because \"the secret inventor merged technology and persuasion,\" he said. His recent writing has focused heavily on the latter topic, including a new book, \" Win Bigly ,\" on how Donald Trump convinced voters to elect him president. \nLater on, Adams would use similar wording when discussing how bitcoin took advantage of the psychology of scarcity, hipness and greed to convince people to adopt it and treat it like it like gold. \n\"It's one of the greatest pieces of persuasion the world's ever seen,\" Adams said. Getting to WIN \nWhenHub's CTO arrived at blockchain after creating previous products that helped people conceptualize and manage time, such as calendar management, timeline visualization and meeting coordination. \nAdams said: \n\"As the world often goes, you start with one good idea and then you discover others that might be more fun and more profitable to chase.\" \nThe company held a hackathon early in the year in which one of the entrants included a blockchain element in his not-quite-completed project. It came to mind for another WhenHub co-founder, CTO Nik Kalyani, when he was speaking to a consultant friend about the struggle to find that next client after completing a project. \nWIN will now allow skilled people to squeeze revenue from gaps in their schedule, while enabling consumers to get knowledgeable answers to very specific questions. Adams said he could have used WIN recently when he spent six months trying to set up a live-streaming studio in his home that could work on all the platforms, such as Facebook and Periscope. \n\"There are just some things you can't Google,\" he said. \nAn hour with someone who has set up a lot of such systems, he continued, would have saved him a lot of time and headache. \nAdams, too, says he gets lots of requests for his time, but finds it difficult to manage all the requests. When he does sit down with people, \"most times they have 15 minutes-worth of questions,\" he said. \nSo experts on WIN can post increments of time as small as 15 minutes on their calendar, setting a minimum price for a consultation. Clients interested in talking to them can then bid for the time slot, and the winning bid is permitted to connect with the expert. \nAfter WhenHub verifies the session took place, client funds are released to the expert via a smart contract. The WHEN token \nEqually important to the network will be its custom cryptocurrency. \nAn ERC-20 token built on top of ethereum, WHEN will manage payments between experts and clients on the WIN platform. By creating its own token, the company is able to seed early adopters with rewards for participation for useful activity without the need to spend fiat money to buy ether to provide those incentives. \n\"This is a case where the token is marketing as well as technology,\" Adams said. \"The two worlds collide.\" \nEarly experts ...",
      "crawled": "2017-10-31T15:59:19.009+02:00",
      "title": "Last Laugh? Dilbert Creator Scott Adams Talks Plans for Token Launch",
      "published": "2017-10-31T15:30:00.000+02:00",
      "author": "Brady Dale",
      "url": "http://omgili.com/ri/.wHSUbtEfZSn_gk062VlfY4LrqtSUM5BfY9.lY3_UyES2WDSt2WfXvo6cRBdeiFM1rccV.dclcrQXSnLiWPSwAfi87BfQZ7Z7gKyG37A51hQJ4Ksj.X7t1u7TGfrWJil",
      "site": "coindesk.com",
      "uuid": "1d686e3168b3c770fce175eebb96940fdec7916d"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0,
    "documentSentiment": {
      "score": -0.1,
      "magnitude": 0.100
    }
  },
  {
    "_id": "59f9ae14706c4779a96a0920",
    "updatedAt": "2017-11-01T11:28:23.745Z",
    "createdAt": "2017-11-01T11:20:52.159Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 0
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 0,
          "comments": 0,
          "likes": 0
        }
      },
      "mainImage": "https://cointelegraph.com/images/725_Ly9jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy83ZDIxMjZhZmZhMGUxNzJjMDE5NjU3YjVjNThkZDBiOC5qcGc=.jpg",
      "domainRank": 45237,
      "text": "Raoul Bova Four Weddings and a Funeral, Blockchain Style The permanence of smart contracts has led to the development of a number of services that allow marriage and marriage contract on the Blockchain. Fintech 577 https://cointelegraph.com/news/four-weddings-and-a-funeral-blockchain-style The permanence of smart contracts has led to the development of a number of services that allow marriage and marriage contract on the Blockchain. Blockchain,Smart Contracts 11240 Total views 215 Total shares Smart contracts have brought the Blockchain closer to real life. After the smart contract is signed, it's submitted for permanent storage as a secure record. This permanence has led to the development of a number of services that allow marriage and marriage contract on the Blockchain. Blockchain is forever The first marriage was registered in the public registry of Blockchain on Oct. 5, 2014. The wedding of David Mondrus and Joyce Bayo took place at a private Bitcoin conference at Disney World in Orlando, Florida. To legalize the marriage, the couple had to scan and confirm the QR code, which was then written directly to the Bitcoin Blockchain. The oath of the newlyweds was: \n\"Life is not eternal and death can separate us, but the Blockchain is forever.\" Witnessing to eternity \nAnother example of a wedding on registered on Blockchain is Bitcoin activist Oles Slobodenyuk and Irina Dukhnovskaya on Jul. 17, 2016. At the celebration, the presenter recorded a marriage certificate in the Weddingbook.io platform on a Blockchain. \nThe site uses the capabilities of Cryptograffiti, a web service that allows people to encode hidden messages into the Bitcoin Blockchain using a special online interface. It is possible not only to record the wedding certificate permanently but also to keep a list of witnesses and wedding vows on a Blockchain. \nDespite the fact that not all marriages are successful, developers foresee a growing number of unions being registered on Blockchains. Some platforms help couples not only register a marriage but also prescribe the conditions of family life in the marriage contract. Smart decisions IT-developers Gaurang Torvekar and Sayalee Kaluskar signed the first and most famous marriage contract on the Blockchain in 2016. The couple downloaded the marriage contract template to the cloud-based File System solution and digitally signed using the Ethereum-based Attores platform. \nThe agreement of Prenup With Love spells out the conditions for cohabitation. For example, the frequency of shopping, the amount of chores done at home, how much time should be spent on night dating, what series they will watch and so on. \nThe contract was activated after both parties sent a coded message from their IP addresses, which was reflected in the smart contract. This contract has an open code and all newlyweds can use it. It should be noted that such contracts do not have legal force yet. The newlyweds commented on their decision as follows: \n\"Speaking about the Blockchain and its endless possibilities, we decided to use it to solve family problems. We believe that to contract a marriage on Blockchain is a smart decision.\" \nThe first marriage in Russia contracted with the help of Blockchain system was registered in October 2017. Vasily Lifanovsky and Alla Tkachenko \nVasily Lifanovsky and Alla Tkachenko combined their crypto-savings into a single family budget. This procedure was carried out on MyWish Platform, aimed at managing cryptocurrency assets in various life situations, including during marriage. Funeral included \nThe idea and implementation of this agreement are significantly different from the Prenup With Love agreement. The essence of the marriage contract on MyWish is that the couple's savings will be combined by a smart contract, where they can transfer funds in the future. In case of termination of the contract, all funds stored on the wallet will be divided in half. To cancel the termination of the contract will be allocated three months, in case of an unwise decision. In case of the death of one party, the funds will be transferred to the account of the heir or the spouse. The husband explains: \n\"When I first learned about the Blockchain, I was struck by the thought that a certain network was created over the existing economic institutions, which we ourselves are influencing. The system inspired me so much that I decided not just to become part of the impending future, but also to influence it. Creating my family I want to make sure that our finances are protected from various circumstances.\" Getting ready for divorce Aside from the existing platforms that allow contracting a marriage now, also new projects for married couples are expected to appear. For instance, in June 2017 on Hackathon forum in Skolkovo, the Moscow team Evolve Team has presented a new project for marriage contracts on Blockchain, the Wedding Chain. This project formula consists of a registry office, marriage contracts and management of t...",
      "crawled": "2017-10-31T16:47:06.001+02:00",
      "title": "Four Weddings and a Funeral, Blockchain Style",
      "published": "2017-10-31T15:55:00.000+02:00",
      "author": "CoinTelegraph By Raoul Bova",
      "url": "http://omgili.com/ri/.wHSUbtEfZSDAcJIStjdfDkxWnrppft1e2LuVChNgtBZ_21ws..kRxNGDSm_XHUdNsgsyE4rdh72UOD177Gf7u.GblTJXACflkj42hBrP_Q-",
      "site": "cointelegraph.com",
      "uuid": "1af1af70f80a8ac80897297171ec9576eed6f57d"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a092b",
    "updatedAt": "2017-11-01T11:28:23.809Z",
    "createdAt": "2017-11-01T11:20:52.243Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 0
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 0,
          "comments": 0,
          "likes": 0
        }
      },
      "mainImage": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png",
      "domainRank": 408,
      "text": "LONDON, Nov 1 (Reuters) - The aggregate value of all cryptocurrencies hit a record high of around $184 billion on Wednesday, according to industry website Coinmarketcap, making their reported market value worth around the same as that of Goldman Sachs and Morgan Stanley combined.\nThe new peak came as the biggest and best-known cryptocurrency, bitcoin, hit a record high of more than $6,500 . That took its own “market cap” - its price multiplied by the number of coins that have been released into circulation - to a record high just shy of $110 billion.\nThe latest surge in bitcoin - which has seen an eye-watering increase of almost 800 percent in the past 12 months - was driven by news on Tuesday that CME Group, the world’s largest derivative exchange operator, would launch bitcoin futures in the fourth quarter of the year.\nThe announcement was seen as a major step in the digital currency’s path toward legitimacy and mainstream financial adoption.\nThe second-most valuable cryptocurrency Ether - sometimes known as “Ethereum”, after the project behind it - was trading slightly down on the day at $302 per coin, having hit a record high of more than $410 in June. (Reporting by Jemima Kelly; Editing by Dhara Ranasinghe)\n ...",
      "crawled": "2017-11-01T12:19:06.000+02:00",
      "title": "Cryptocurrencies' total value hits record high as bitcoin blasts above $6,500",
      "published": "2017-11-01T07:18:00.000+02:00",
      "author": "Reuters Editorial",
      "url": "http://omgili.com/ri/.wHSUbtEfZRtKw217TY9P0ZJCnfITvC0iCC9r6l.6sUEYOHrphOcCKCmXgO4Lliip8nOyq0Th3JeifSYQQpAC32P9TKfcUJYHJ0CS.51bhMefFV56BxiAhbFV5r2.WJZZX4XpodhK_T3y4QX.TFmw7YFPs9c51ev3aGSb2IxGPD_9_kqEzmliQ9pKUiJtxdL83gW4aJCEhk-",
      "site": "reuters.com",
      "uuid": "b929f0d0fedddbd389e35e6f596a0a383d1a9f73"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a092c",
    "updatedAt": "2017-11-01T11:28:23.826Z",
    "createdAt": "2017-11-01T11:20:52.249Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 0
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 0,
          "comments": 0,
          "likes": 0
        }
      },
      "mainImage": "https://s3.reutersmedia.net/resources/r/?m=02&d=20171101&t=2&i=1207880949&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPEDA02R6",
      "domainRank": 408,
      "text": " 27 AM / in 19 minutes Cryptocurrencies' total value hits record high as bitcoin blasts above $6,500 Jemima Kelly 2 Min Read LONDON (Reuters) - The aggregate value of all cryptocurrencies hit a record high of around $184 billion on Wednesday, according to industry website Coinmarketcap, making their reported market value worth around the same as that of Goldman Sachs and Morgan Stanley combined. A copy of bitcoin standing on PC motherboard is seen in this illustration picture, October 26, 2017. Picture taken October 26, 2017. REUTERS/Dado Ruvic The new peak came as the biggest and best-known cryptocurrency, bitcoin, hit a record high of more than $6,500. That took its own “market cap” - its price multiplied by the number of coins that have been released into circulation - to a record high just shy of $110 billion. The latest surge in bitcoin - which has seen an eye-watering increase of almost 800 percent in the past 12 months - was driven by news on Tuesday that CME Group, the world’s largest derivative exchange operator, would launch bitcoin futures in the fourth quarter of the year. The announcement was seen as a major step in the digital currency’s path toward legitimacy and mainstream financial adoption. The second-most valuable cryptocurrency Ether - sometimes known as “Ethereum”, after the project behind it - was trading slightly down on the day at $302 per coin, having hit a record high of more than $410 in June. Reporting by Jemima Kelly; Editing by Dhara Ranasinghe...",
      "crawled": "2017-11-01T12:48:37.000+02:00",
      "title": "Cryptocurrencies' total value hits record high as bitcoin blasts above $6,500",
      "published": "2017-11-01T12:20:00.000+02:00",
      "author": "",
      "url": "http://omgili.com/ri/.wHSUbtEfZQ8vPZA6toGHkl1dV4_QYkwrQoWXEeAafeO.oLOIHV0X65EOo6gu4HAHPCI70sQzz.I9rE3cqbg1s2lT2gbMrOh5k_r9S6LmnBcBr4qvklDPUfvQfl.Au_frBeGN_63nEy7g2LbX1AgBvfb23llsZobU7oLIoo1pKVIWJv0mWzc68KZLdSzEbeVXz3fYWL_c5YMmtXB63HR.w--",
      "site": "reuters.com",
      "uuid": "cbd476444889ca717ef8d473953c00d1640f62fb"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a092d",
    "updatedAt": "2017-11-01T11:28:23.823Z",
    "createdAt": "2017-11-01T11:20:52.252Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 0
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 0,
          "comments": 0,
          "likes": 0
        }
      },
      "mainImage": "https://s2.reutersmedia.net/resources/r/?m=02&d=20171101&t=2&i=1207881497&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPEDA02RH",
      "domainRank": 408,
      "text": "LONDON (Reuters) - The aggregate value of all cryptocurrencies hit a record high of around $184 billion on Wednesday, according to industry website Coinmarketcap, making their reported market value worth around the same as that of Goldman Sachs and Morgan Stanley combined.\nA copy of bitcoin standing on PC motherboard is seen in this illustration picture, October 26, 2017. Picture taken October 26, 2017. REUTERS/Dado Ruvic The new peak came as the biggest and best-known cryptocurrency, bitcoin, hit a record high of more than $6,500. That took its own “market cap” - its price multiplied by the number of coins that have been released into circulation - to a record high just shy of $110 billion.\nThe latest surge in bitcoin - which has seen an eye-watering increase of almost 800 percent in the past 12 months - was driven by news on Tuesday that CME Group, the world’s largest derivative exchange operator, would launch bitcoin futures in the fourth quarter of the year.\nThe announcement was seen as a major step in the digital currency’s path toward legitimacy and mainstream financial adoption.\nThe second-most valuable cryptocurrency Ether - sometimes known as “Ethereum”, after the project behind it - was trading slightly down on the day at $302 per coin, having hit a record high of more than $410 in June.\nReporting by Jemima Kelly; Editing by Dhara Ranasinghe\n ...",
      "crawled": "2017-11-01T13:16:54.000+02:00",
      "title": "Cryptocurrencies' total value hits record high as bitcoin blasts above $6,500",
      "published": "2017-11-01T07:28:00.000+02:00",
      "author": "Jemima Kelly",
      "url": "http://omgili.com/ri/.wHSUbtEfZRtKw217TY9P0ZJCnfITvC0m30sCHr2utYTkprPTjFAhVGACBG.h9DMa2QdTRjUMmQeL8I5bT83N9DnBwrvLjP_FoYtCX7FSujphTQ1Fpgw8E_L1c4RM22XIZoI2iALAIC35czhYOI6Q_4BMrb8seyoLOTIYg_5WFaSTxxOfoazp5jl.JxvmXk3r6JsNqdaJLQJ8d0UoVNoZw--",
      "site": "reuters.com",
      "uuid": "fad3731484a504f3aa0b1261f387dd4d21131ce5"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a092e",
    "updatedAt": "2017-11-01T11:28:23.854Z",
    "createdAt": "2017-11-01T11:20:52.273Z",
    "post": {
      "social": {
        "vk": {
          "shares": 1
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 4
        },
        "pinterest": {
          "shares": 1
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 26,
          "comments": 0,
          "likes": 26
        }
      },
      "mainImage": "https://cdn.vox-cdn.com/thumbor/1B77t6STClej0JdZzuFfMFdl8Rg=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/9575839/cryptocurrency_0004.jpg",
      "domainRank": 496,
      "text": "share After years of ambiguous signals, Russian president Vladimir Putin finally clarified Russia’s stance on cryptocurrencies last week with five presidential orders demanding officials set up a legal framework to handle digital currencies. The orders include plans to tax crypto miners, regulate ICOs, sandbox legislation for newly developed blockchain technologies, and an order that outlines the “formation of a single payment space,” likely part of the digital ruble initiative that the Russian Central Bank has been pursuing. It’s a surprising development that could solidify cryptocurrency acceptance within the Russian Federation. It’s been a big year for cryptocurrencies: Bitcoin and Ethereum have seen exponential growth in value, and ICOs around the world have generated $2.6 billion in investment. It’s also been a year of regulatory scrutiny: governments in China, South Korea, the US, and most recently, Vietnam , have been introducing legislation to address the recent boom. China has banned Bitcoin exchanges and other trading platforms, and South Korea has planned a ban on raising money through ICOs. In the midst of a worldwide regulatory crackdown, however, Russia’s back-and-forth position has befuddled observers. On the one hand, Russia has pointed toward wider acceptance. Over the past year, Russian officials have actively encouraged the development of cryptocurrency mining. In June, Putin met with Vitalik Buterin, the founder of Ethereum, in a meeting many interpreted as a government endorsement of digital currencies. As Putin said at the St. Petersburg International Economic Forum that month, boosting the Russian economy and increasing average household incomes “can be done only by developing innovative technologies, including digital technologies.” Since last year, the Russian Central Bank has been overseeing a group of financial institutions that are testing an Ethereum-like “master chain” to possibly issue digital rubles. “The rush to virtual money is not a fad.” This past July , Putin’s aide on internet matters, Dmitry Marinichev, took international press on a tour of his own cryptocurrency mine. Marinichev had converted what was originally a Soviet era car factory into a cryptocurrency server farm. Speaking over the hum of mining rigs, Marinichev revealed he had started a company called the Russian Miner Coin. \"The rush to virtual money is not a fad or a fleeting phenomenon. The virtualization of our lives is a market process that has gone on and will continue,\" he said, according to AFP . A few weeks later, Marinichev announced that Russian Miner Coin was launching an ICO for RMC virtual tokens, which aimed to raise $100 million worth of bitcoin and Ethereum. The plans were detailed in a media deck that touted Russia’s cold climate and cheap electricity bills. The governor of Russia’s Leningrad region, Alexander Drozdenko, recently invited crypto miners to set up a facility in the vicinity of the Leningrad nuclear power plant in order to take advantage of the area’s cheap electricity. News reports suggest that cryptocurrencies are becoming more visible across the country. This past summer, cafes and restaurants in Moscow began accepting crypto payments . Computer stores throughout the country reported graphic and video card shortages, which crypto miners use to boost their rigs. According to local media , AMD Radeon cards were sold out nationwide in June, and even the remaining units of the Nvidia Geforce GTX 1060 were highly coveted. In August, Burger King rolled out a cryptocurrency in Russia: the Whoppercoin . Just last month, statements from Russia’s finance minister Anton Siluanov indicated that cryptocurrency would soon be treated like regular financial securities, an approach similar to the one adopted by US Securities Exchange Commission. Over the same period, Russia has sent competing signals indicating that a crackdown on cryptocurrency may be imminent. Earlier this month, Putin called for greater cryptocurrency regulation, citing the “serious risks” that virtual currency could pose. Russian officials, including economic development minister Maxim Oreshkin and the Bank of Russia chairman Elvira Nabiullina , have previously referred to cryptocurrency mining and exchange operations as “pyramid schemes.” That characterization is a throwback to Russia’s stance on cryptocurrencies last year, when the Kremlin was considering jailing individuals up to seven years for using or owning bitcoins. Until Putin’s most recent order, that conflicting narrative left observers scratching their heads. The new regulation would outline an approach that would regulate cryptocurrency across Russia tightly, while still not ruling it illegal. “society is ready to accept blockchain technology; the state is not.” Russia’s sometimes contradicting approach to cryptocurrency regulations is “that society is ready to accept blockchain technology; the state is not,” says Vladimir Popov, a crypto-enthusiast and lawyer...",
      "crawled": "2017-10-31T18:49:00.008+02:00",
      "title": "Inside Russia’s love-hate relationship with Bitcoin",
      "published": "2017-10-31T19:36:00.000+02:00",
      "author": "theverge.com",
      "url": "http://omgili.com/ri/.wHSUbtEfZQrTHDoKYSJbjrpQN.N5MJg_62zFuGp83Se50hSyLZwYu5bRIti0_CSiA7eksJ4GbtuuSVcovaRWs4i7KLAjJp6vIqT5C3U2IZlFbPao_L66p.UFMbSFwnbyGI6_K7QZmB.ag1vU8yVKQ--",
      "site": "theverge.com",
      "uuid": "73705ef9737a856abd0e7722b5e01b9fded8ec16"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a0937",
    "updatedAt": "2017-11-01T11:28:23.872Z",
    "createdAt": "2017-11-01T11:20:52.326Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 0
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 0,
          "comments": 0,
          "likes": 0
        }
      },
      "mainImage": "http://bitcoinist.com/wp-content/uploads/2017/10/confideal-ecosystem-cover.jpg",
      "domainRank": null,
      "text": "\nConfideal boasts a vibrant ecosystem where the core features of the integrated platform, such as smart contracts and arbitration, unite to form an application that is far more than just the sum of its parts. \n[Note: This is a sponsored article.] \nInternational trade has existed since ships first sailed upon the seas and caravans crossed mountains, but the increasing pace of technological innovation has led to a massive surge in international trade. Contracts and manufacturing details can be hammered out over video conference calls while documents can be digitally signed and sent across the world without a person having to move from their office desk. \nOf course, this increased amount of trade can have potential headaches, especially if a dispute arises, which is where Confideal comes into play. Confideal is an integrated platform based upon the Ethereum blockchain that features an amazing ecosystem of core features that helps facilitate trade while reducing costs. Three Core Pillars \nThe three core pillars of Confideal are: smart contracts, built-in arbitration, and CDL tokens. A number of platforms offer a single feature or two that international traders might be interested in, but Confideal is unique in that it has created a complete ecosystem composed of individual functions that come together into a harmonious whole. \nSmart contracts have been revolutionary in matters of data management, and they offer a tremendous boon to businesses by creating a document that cannot be altered and is openly transparent. Many businesses have failed to take advantage of smart contracts due to the perceived need for programming knowledge and a dedicated online team, but Confideal allows for the creation of Ethereum-based smart contracts without the need for any coding. \nBuilt into the smart contract is the arbitration feature of Confideal. The entity drawing up the contract selects an arbitrator to be used in case of a dispute arises. An important consideration is that all signatories to the smart contract have to agree to the chosen arbitrator. \nLegal professionals and firms apply to Confideal, showing their qualifications and credentials, to become arbitrators on the platform. Arbitration takes one of two routes: both parties can agree to abide by the decision of the arbitrator or an arbitrator can come to a conclusion that can then be used in international courts of law for further enforcement. \nThe final core facet of Confideal is the CDL token, which is the main internal cryptocurrency for the platform. The token was created according to the ERC20 token standard on the Ethereum blockchain and has several uses on the integrated platform. Bringing It All Together \nEach Confideal’s three core features, when viewed independently of each other, is quite beneficial in regards to international trade. However, the symbiotic manner in which they all work together is breathtaking. The features weave together into an intricate dance that reinforce each other and make the overall ecosystem far stronger than each of the individual components. \nMerchants can use CDL tokens to generate smart contracts and act as currency for the payment of the contract, which negates the standard 1% fee. These tokens can also be freely exchanged for other ERC20 tokens. \nThe smart contract, standing alone, is an amazing innovation for trade, but the inclusion of arbitration takes the smart contract to an entirely new level. Merchants not only have a codified document that spells out the conditions of the deal, not to mention the funds held in escrow and that the contract is unable to be illegally modified, but an automatic means for resolving a disagreement that all parties have already agreed upon has been put into place. \nThe dance between arbitrators and CDL tokens continues in the fact that token holders have a number of votes, based upon the number of tokens held, that can be cast to rank specific arbitrators. Every ten tokens equals one vote, so token holders have the right to directly influence the arbitration aspect of Confideal. However, this influence is not absolute as the smart contract that details the arbitrator has to be agreed upon by all interested parties. Then there’s the fact that arbitrators have no details on the principals of the smart contract, so there’s no undue influence of favoring a side that has given votes to that particular arbitrator. \nEach of the core features of Confideal is of great use to merchants, but it’s the combination of all three elements (smart contracts, tokens, and arbitrators) into a cohesive whole that makes the integrated platform far greater than the sum of its parts. Each facet of Confideal reinforces the others, making them stronger and better than they would be on their own. Tokens can be used as payment and to rank arbitrators whilst arbitration is hardwired into the smart contracts that serve as the foundation of the platform. In the end, merchants and arbitrators are united together into wor...",
      "crawled": "2017-11-01T01:36:52.012+02:00",
      "title": "Confideal - More Than Just the Sum of Its Parts - Bitcoinist.com",
      "published": "2017-10-31T21:45:00.000+02:00",
      "author": "Jeff Francis",
      "url": "http://omgili.com/ri/_0JOtn.4SCpu2xhlqzh54Chnaqr8MS1Gdr1D6bTCFBEPjyPMoEev3ir_fPjeR5Fb",
      "site": "bitcoinist.com",
      "uuid": "056b343437642caea6ccb3bd78d4cebedde592dc"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a0947",
    "updatedAt": "2017-11-01T11:28:23.894Z",
    "createdAt": "2017-11-01T11:20:52.445Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 5
        },
        "pinterest": {
          "shares": 6
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 51,
          "comments": 0,
          "likes": 51
        }
      },
      "mainImage": "https://media.coindesk.com/uploads/2017/10/socrates.jpg",
      "domainRank": 10453,
      "text": "Privacy and Scalability? ZoKrates Devcon Announcement Brings Both to Ethereum Nov 1, 2017 at 00:37 Features • Ethereum • Other Public Protocols • Technology News \nScalability and privacy are top of mind for ethereum developers. \nAnd Jacob Eberhardt's new programming language, ZoKrates, aims to address these topics – providing ethereum developers with a toolkit that could help the network realize the full potential of privacy tech zk-snarks. Zk-snarks was popularized by anonymous cryptocurrency zcash, but ethereum's recent hard fork Byzantium included a couple procedures that pave the way for easier use of the tech on its blockchain. \nRevealed during Devcon3, ethereum's annual developer conference, today, ZoKrates allows information to be obscured off-chain and then uploaded into a smart contract that can be verified on the ethereum blockchain without exposing any of the contract's information. \nThe implications of ZoKrates are vast. For one, it's designed to be so simple to use that any ethereum developer can deploy the technology, which could mean privacy features start emerging across ethereum use-cases, from decentralized applications (dapps) to ERC-20 tokens. And second, because zk-snarks compress information, ZoKrates has the potential to help scale the ethereum platform. by moving computations off-chain and lifting some of the burden off the blockchain. \nAs Eberhardt, a PhD researcher at the Technical University Berlin, told CoinDesk: \n\"zk-SNARKs were discussed a lot in the community over the last two years, but the gap between the theoretical concept and its practical application seemed huge. This gap, I try to bridge.\" \nPrivacy – which has generally been seen as a shortcoming of ethereum – and scalability are hot topics at this year's Devcon3 as ethereum developers prepare to put their heads down to make ethereum live up to its high expectations. Private and smart contracts \nWith ZoKrates, an ethereum smart contract – which only executes if certain pre-conditions are met – serves as a way to transfer a zk-snark operation onto the blockchain and to verify that that information is valid. \nAs Eberhardt describes, a ZoKrates contract verifies that an unknown computation occurred correctly, or in his words, a ZoKrates, “transforms a program into a set of conditions.” \nThis moves ethereum one step closer to offering private transactions on its blockchain, the \"practical implementations\" that ethereum's zk-snarks lead Christian Reitwießner, told CoinDesk in September would be missing to make the technology useful directly following the Byzantium hard fork. \nBut like bringing privacy to ethereum in the first place, the endeavor is complex. \nFor one, verifying a zk-snark is still expensive. When encrypted information is read and accepted onto the ethereum blockchain, it costs a lot of computational effort, which in ethereum is measured in units of ‘gas’. \nWhile ZoKrates gets around this in some ways by moving privacy computations off-chain, the on-chain verification process is still quite costly. \nAlthough, Eberhardt has said that ethereum could, through future upgrades, make this process less expensive. Byzantium, for example, already introduced some mechanisms for making private transactions more affordable like gas-subsidized pairings. Steps towards scalability \nAlthough, the cryptography still has hurdles to overcome. Right now it requires quite a lot of \"gas\"- about a quarter of the overall limit placed on ethereum blocks. \nCrucially though, the cost of verifying a ZoKrates contract remains stable at all times, regardless of the complexity of the computation it represents. At present, a ZoKrates verification fee is about 1.6 million gas. Put simply, anything above this figure would be cheaper to run on ZoKrates. \nThe same applies for anything that can't fit inside a single block- because the size of a ZoKrates verification is consistent. So if deployed, the blockchain would be filled with strings of verifications, rather than transactional information. Eberhardt explains that this could \"lead to higher throughput,\" as more verifications could fit inside a block than the computations themselves. \nBut that's not to say there aren't a few roadblocks in the way. \nSpeaking to CoinDesk, Eberhardt identified two major challenges to the software to date. For one, although Eberhardt is currently dedicated to making the language \"more expressive, intuitive and easy to use,\" it's still very much under development. \nEberhardt open sourced the language today, but specifies it's still in the prototyping stage and is not yet ready for deployment. On top of that, Eberhardt is currently working on the project alone, with some input and discussion from zk-snarks ethereum lead Christian Reitwießner, so for that reason, says he can’t predict the development timeline. \nThe other major concern- less of a problem with ZoKrates as it is with zk-snarks itself- is the unfortunate \"trusted setup.\" \nIn the generation of a zk-snark...",
      "crawled": "2017-11-01T02:49:41.002+02:00",
      "title": "Privacy and Scalability? ZoKrates Devcon Announcement Brings Both to Ethereum",
      "published": "2017-11-01T02:37:00.000+02:00",
      "author": "Rachel Rose O'Leary",
      "url": "http://omgili.com/ri/.wHSUbtEfZSn_gk062VlfY4LrqtSUM5Bcd7t6nv.5wZvh5E8RH6zXf7zV517VwOKfvNj.AEpmpZSe.nLBgIVReT0r4bECA7_w5fn9RefWvMChdnNEnWvWSKttgd7tJgJ",
      "site": "coindesk.com",
      "uuid": "701040312ba6f0dd2d044802b8d7f4b47e26af0c"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  },
  {
    "_id": "59f9ae14706c4779a96a094c",
    "updatedAt": "2017-11-01T11:28:23.937Z",
    "createdAt": "2017-11-01T11:20:52.485Z",
    "post": {
      "social": {
        "vk": {
          "shares": 0
        },
        "stumbledupon": {
          "shares": 0
        },
        "linkedin": {
          "shares": 4
        },
        "pinterest": {
          "shares": 0
        },
        "gplus": {
          "shares": 0
        },
        "facebook": {
          "shares": 46,
          "comments": 0,
          "likes": 46
        }
      },
      "mainImage": "https://cdn1.i-scmp.com/sites/default/files/styles/620x356/public/images/methode/2017/10/31/fd1873c6-be1c-11e7-b942-6d23cbdef96a_image_hires_173315.JPG?itok=LhTVIXH2",
      "domainRank": 8108,
      "text": "Some Chinese bitcoin exchanges – having had their trading officially ordered to halt last month as the cryptocurrency comes under renewed scrutiny by the domestic authorities – have turned their attention instead to selling overseas.\nThe mainland’s ban on transaction between renminbi and digital assets at exchanges came into effect on Tuesday. That followed banning fundraising through initial coin offerings in early September.\nBut now it seems some operators have already started looking elsewhere for business.\n\nZB.com, an overseas platform operated by Chinese digital currency exchange chbtc, has said it will make an international trading function available from Wednesday, allowing users to first sign up for accounts and deposits.\nThe Chinese-English bilingual site offers price quotations for nine cryptocurrencies including bitcoin and ethereum, the two largest by value. Transactions can either be denominated in bitcoin or USDT, a token created by Tether which has an equivalent value to US dollar.\nBitcoin in free fall after China’s Bitkan suspends over-the-counter trading \nHuobi and OkCoin, two of China’s other most popular exchanges, revealed their plans on Tuesday evening, the last day they were able to accept renminbi-denominated bitcoin trades.\n“It’s an end, as well as a new beginning,” said OkCoin in a statement on its homepage, while promoting its offshore exchange OKEx, which will allow investors to conduct “consumer-to-consumer trading of digital currencies against legal tenders of many countries.\nIn a similar move, Huobi announced it has launched a Singapore-based professional portal, offering investors peer-to-peer trading services as a means of payment in place of legal tenders. The team will also operate a Hong Kong subsidiary.\nChina’s bitcoin gloom may be Hong Kong’s boon as crypto issuers switch to city’s exchanges \n“Once the work has been completed to help investors withdraw from platforms, and all trading services have halted, we will be able to provide services using US dollars and digital assets to qualified investors worldwide,” said Li Lin, Huobi’s founder said in an open letter.\nInvestors can also choose to trade digital won-denominated assets on the company’s portal based in South Korea, according to Huobi.\nA form of virtual currency created using blockchain technology, cryptocurrencies have been under close regulatory scrutiny after explosive growth raised concerns that a meltdown of the unregulated market could spill over onto China’s financial market and increase instability.\nHowever, the latest moves by exchanges had sparked renewed speculation that China may loosen its grip on the digital currencies after the 19th Party Congress, which ended last week.\nNearly 20 Chinese exchanges announced plans last month to halt digital currency trading by no later than October, after meeting with the country’s central bank.\nWhy has China declared war on bitcoin and digital currencies? \nCryptos are not legal tender in China, and the central bank has placed an outright ban on banks or financial institutions holding them, although such regulation leaves room for individuals to own them.\nEven amid the clampdown, China has remained a major market for bitcoin investors, with as much as 90 per cent of transactions worldwide still taking place in the country, which also generates roughly one in every two new coins created through mining.\nOn the US exchange Bitstamp, bitcoin currently trades at US$6,095, a record high, after surging 49.2 per cent over the past three months....",
      "crawled": "2017-10-31T16:15:15.000+02:00",
      "title": "As China closes its doors to cryptocurrencies, exchanges shift their attention overseas",
      "published": "2017-11-01T03:30:00.000+02:00",
      "author": "Sarah Dai",
      "url": "http://omgili.com/ri/jHIAmI4hxg_9Yr2dDCKBfTAg9uCFEOuM1rsorOyfHpRw.yTUDBMEBLjW4D6t8oMdvwFGr8GBRFsudLg5FFZA7uQ8S3LGYubJ25dmAe7RSpPJJXwXjj_g5j.am3UUlb7gf0UBPzjABZ37pBCLmALbwu7uyzE.iQ7d",
      "site": "scmp.com",
      "uuid": "a44b9ef89d7cdf52c1cd169213a63c6d38cbf09e"
    },
    "topic": [
      "cryptocurrency",
      "ethereum"
    ],
    "__v": 0
  }
]